balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87J72.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA10" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA10" edc:desc="" edc:mask="0xff" edc:name="LCDDATA10" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C1" edc:desc="" edc:mask="0x1" edc:name="S32C1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM1" edc:desc="" edc:mask="0x1" edc:name="SEG32COM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA12" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA12" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA12" edc:desc="" edc:mask="0xff" edc:name="LCDDATA12" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S00C2" edc:desc="" edc:mask="0x1" edc:name="S00C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C2" edc:desc="" edc:mask="0x1" edc:name="S01C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C2" edc:desc="" edc:mask="0x1" edc:name="S02C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C2" edc:desc="" edc:mask="0x1" edc:name="S03C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C2" edc:desc="" edc:mask="0x1" edc:name="S04C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C2" edc:desc="" edc:mask="0x1" edc:name="S05C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C2" edc:desc="" edc:mask="0x1" edc:name="S06C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C2" edc:desc="" edc:mask="0x1" edc:name="S07C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM2" edc:desc="" edc:mask="0x1" edc:name="SEG0COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM2" edc:desc="" edc:mask="0x1" edc:name="SEG1COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM2" edc:desc="" edc:mask="0x1" edc:name="SEG2COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM2" edc:desc="" edc:mask="0x1" edc:name="SEG3COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM2" edc:desc="" edc:mask="0x1" edc:name="SEG4COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM2" edc:desc="" edc:mask="0x1" edc:name="SEG5COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM2" edc:desc="" edc:mask="0x1" edc:name="SEG6COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM2" edc:desc="" edc:mask="0x1" edc:name="SEG7COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S0C2" edc:desc="" edc:mask="0x1" edc:name="S0C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S1C2" edc:desc="" edc:mask="0x1" edc:name="S1C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2C2" edc:desc="" edc:mask="0x1" edc:name="S2C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S3C2" edc:desc="" edc:mask="0x1" edc:name="S3C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S4C2" edc:desc="" edc:mask="0x1" edc:name="S4C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S5C2" edc:desc="" edc:mask="0x1" edc:name="S5C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S6C2" edc:desc="" edc:mask="0x1" edc:name="S6C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S7C2" edc:desc="" edc:mask="0x1" edc:name="S7C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA13" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA13" edc:desc="" edc:mask="0xff" edc:name="LCDDATA13" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C2" edc:desc="" edc:mask="0x1" edc:name="S8C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S9C2" edc:desc="" edc:mask="0x1" edc:name="S9C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C2" edc:desc="" edc:mask="0x1" edc:name="S10C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C2" edc:desc="" edc:mask="0x1" edc:name="S11C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C2" edc:desc="" edc:mask="0x1" edc:name="S12C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C2" edc:desc="" edc:mask="0x1" edc:name="S13C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C2" edc:desc="" edc:mask="0x1" edc:name="S14C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C2" edc:desc="" edc:mask="0x1" edc:name="S15C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM2" edc:desc="" edc:mask="0x1" edc:name="SEG8COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM2" edc:desc="" edc:mask="0x1" edc:name="SEG9COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM2" edc:desc="" edc:mask="0x1" edc:name="SEG10COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM2" edc:desc="" edc:mask="0x1" edc:name="SEG11COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM2" edc:desc="" edc:mask="0x1" edc:name="SEG12COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM2" edc:desc="" edc:mask="0x1" edc:name="SEG13COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM2" edc:desc="" edc:mask="0x1" edc:name="SEG14COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM2" edc:desc="" edc:mask="0x1" edc:name="SEG15COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C2" edc:desc="" edc:mask="0x1" edc:name="S08C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C2" edc:desc="" edc:mask="0x1" edc:name="S09C2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA14" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA14" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA14" edc:desc="" edc:mask="0xff" edc:name="LCDDATA14" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C2" edc:desc="" edc:mask="0x1" edc:name="S16C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C2" edc:desc="" edc:mask="0x1" edc:name="S17C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C2" edc:desc="" edc:mask="0x1" edc:name="S18C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C2" edc:desc="" edc:mask="0x1" edc:name="S19C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C2" edc:desc="" edc:mask="0x1" edc:name="S20C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C2" edc:desc="" edc:mask="0x1" edc:name="S21C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C2" edc:desc="" edc:mask="0x1" edc:name="S22C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C2" edc:desc="" edc:mask="0x1" edc:name="S23C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM2" edc:desc="" edc:mask="0x1" edc:name="SEG16COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM2" edc:desc="" edc:mask="0x1" edc:name="SEG17COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM2" edc:desc="" edc:mask="0x1" edc:name="SEG18COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM2" edc:desc="" edc:mask="0x1" edc:name="SEG19COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM2" edc:desc="" edc:mask="0x1" edc:name="SEG20COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM2" edc:desc="" edc:mask="0x1" edc:name="SEG21COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM2" edc:desc="" edc:mask="0x1" edc:name="SEG22COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM2" edc:desc="" edc:mask="0x1" edc:name="SEG23COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
